[
  {
    "id": 1,
    "category": "Statistics",
    "title": "What is statistics, and why can it be useful for cybersecurity?",
    "text": "Statistics is the study of data through collection and analysis. It is used to make data understandable and to predict a social or scientific phenomenon that we understand, amongst many things. Statistics is indeed used in sociology, biology and engineering. It is a mathematical science since the foundations of statistics rely on probability theory.\n\nIn general, applied statistics start with the observation of a collection of objects or living beings that we call a population. We can extract data from their properties and interpret the data. However, it is usually impossible to get data from the entire population without exception. For instance, it would be impractical to ask every human on Earth if they got infected by Covid or not. This is why we take smaller samples that we can assess to be representative of the population. Furthermore, we also have to consider that we can make errors while collecting data.\n\nThrough my research, I’ve learned we usually separate Statistics into two underlying domains. First, there are descriptive statistics which deal with summarizing data (mean, variance, etc.) to ease data representation. On the other hand are inferential statistics, making predictions or decisions based on samples, with a determined level of confidence.\n\nSo, how can we use this science for cybersecurity?\n\nI tried to think about it by myself and the only thing I could come up with was that we could use traffic data to see which sites are vulnerable to attack by overload. And I also read that statistics could be used in cryptography.\n\n\nAfter some research to get a better understanding of this connection between statistics and cybersecurity, I found that we use statistical models to classify events as normal or malicious in order to improve intrusion detection systems.\nMoreover, Machine learning models rely on statistics principles and they are used a lot to make efficient tools such as spam filters or malware detection. Indeed, we extract features from data that is going to be analyzed and we also use statistics to evaluate the model (mean squared error, accuracy, and many other standard indicators).\n\nI personally follow Biometric Systems so this course will be very beneficial for me. And hopefully, I will get insights that will help me with the probabilities in the Quantum Computing course.\n\nTo conclude, statistics can help to predict and understand, but also detect automatically in an efficient way, cybersecurity threats.\n\nACHAT Erwan (Student ID: 2244316)\nFirst assignment"
  }
]
